app/controllers/equipes_controller.rb

  def index
    @equipes = Equipe.all
---
SELECT "equipes".* FROM "equipes"