app/controllers/institucionals_controller.rb

  def index
    @institucionals = Institucional.all
---
SELECT "institucionals".* FROM "institucionals"

  def show
    @institucional = Institucional.find(params[:id])
---
SELECT "institucionals".* FROM "institucionals" WHERE "institucionals"."id" = ? LIMIT 1  [["id", "view"]]